Autodesk.Navisworks.Api.ApplicationParts.ApplicationDragDrop
Represents Application level Drag & Drop.

Autodesk.Navisworks.Api.ApplicationParts.ApplicationDragDrop.DecodeData(System.Windows.Forms.IDataObject,System.Int32@)
Tries to decode the data passed in drag drop operations.
If successful determines the source Process Id.

Autodesk.Navisworks.Api.ApplicationParts.ApplicationDragDrop.DecodeDataWpf(System.Windows.IDataObject,System.Int32@)
Tries to decode the data passed in drag drop operations.
If successful determines the source Process Id.

Autodesk.Navisworks.Api.ApplicationParts.ApplicationDragDrop.Format
Name of the format used for Navisworks drag drop operations.
Currently is just a notification theat Current Selection has been dragged.